export default {
  projections: {
    ПокупкаE: {
      сумма: {
        __caption__: 'Сумма'
      },
      количество: {
        __caption__: 'Количество'
      },
      ценноваяСтела: {
        __caption__: 'Ценновая стела',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      остаток: {
        __caption__: 'Остаток',
        номер: {
          __caption__: 'Номер'
        }
      },
      базаКлиента: {
        __caption__: 'База клиента',
        логин: {
          __caption__: 'Логин'
        }
      }
    },
    ПокупкаL: {
      сумма: {
        __caption__: 'Сумма'
      },
      количество: {
        __caption__: 'Количество'
      },
      ценноваяСтела: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      остаток: {
        __caption__: 'Номер',
        номер: {
          __caption__: 'Номер'
        }
      },
      базаКлиента: {
        __caption__: 'Логин',
        логин: {
          __caption__: 'Логин'
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'Количество'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    базаКлиента: {
      __caption__: 'База клиента'
    },
    остаток: {
      __caption__: 'Остаток'
    },
    ценноваяСтела: {
      __caption__: 'Ценновая стела'
    }
  }
};
